TravelGoodApp/test/TestCase3/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trav="http://travelgood.ws">
  <soapenv:Body>
    <trav:addHotel>
      <clientId>client1</clientId>
      <itineraryId>itinerary1</itineraryId>
      <bookingNum>hotel1</bookingNum>
    </trav:addHotel>
  </soapenv:Body>
</soapenv:Envelope>